#pragma once
/************************************************************************************
 *																					*
 *	役割：敵キャラの共通部分を管理する。											*
 *																					*
 *	説明：敵キャラの共通部分を管理する。											*
 *																					*
 *	作成日：2008年11月 8日															*
 *																					*
 *	更新日：2008年 月 日															*
 *													by 三上　亘						*
 *																					*
 ************************************************************************************/
/*================================
	
		INCLUDEたち

=================================*/
#include "CharaCommon.h"
/*================================
	
		Defineたち

=================================*/

/*================================
	
		structたち

=================================*/

class C_EnemyCommon :	public C_CharaCommon
{
protected:
	int m_attribute_enemy;		//敵の属性の種類判別（味方でいうところのマテリアル属性）
	bool m_stop_enemyl;			//行動停止(味方キャラの技)を食らったかどうかの判定
public:
	C_EnemyCommon(void);
	~C_EnemyCommon(void);
};
