#pragma once

/************************************************************************************
 *																					*
 *	役割：ゲームオーバー時の管理をします											*
 *																					*
 *	説明：ゲームーバーのControlとRenderがあります									*
 *																					*
 *	作成日：2008年 8月 6日															*
 *																					*
 *	更新日：2008年 11月21日															*
 *													by	平野　努					*
 *																					*
 ************************************************************************************/

/*================================
	
		INCLUDE

=================================*/
#include "Scene.h"

/*================================
	
		Defineたち

=================================*/
#define MAX_TEXTURE_GAMEOVER	(10)


class C_Gameover : public C_Scene
{
public:
	C_Gameover();
	void Control(int* key);
	void Init();
	void Draw();
	void Sound();				//サウンドの管理
	void Release();
	~C_Gameover();
};
